---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryConditionsType
source: html/8df8f1d3-bb47-76f8-e212-be67f7aaaf9e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryConditionsType Property

"Boundary Conditions Type"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryConditionsType { get; }
```